%%    パラメータsetting      %%

%% 物性パラメータ
rho = 998.2;%流体密度[kg/m^3]
nu = 1.004e-6;%動粘度[m^2/s]

u_w = 1e-1;%inlet 流入速度[m/s]
v_w = 0;%oulet 流入速度[m/s]
u_w_obj = 0;%物体表面速度[m/s]
v_w_obj = 0;%物体表面流入速度[m/s]
du_dn = 0;%流速一階微分規定境界条件(x成分)[1/s]
dv_dn = 0;%流速一階微分規定境界条件(y成分)[1/s]

b_width = 20e-3;%推進体高さ[m]
S_area = 1*b_width;%単位長さあたりの投影面積[m^2]

d_Time = 0.001;%刻み時間[s]
Time_max = 25.0;%解析終了時間[s]


%% 計算パラメータ
EPS = 200e-3;%境界上の節点間距離を元に境界を分割する基準距離[mm]
CNT=10;%すき間幅分割数[-]
dz = 5e-4;%境界識別距離[-]

%% ギャップ幅設定
gap_max = 100e-3;%[m]
gap_min = 1e-3;%[m]

%% 流速範囲
u_num_max = 10;%流速変化刻み数
U_in_max = 100e-3;%最大流入速度[m/s]
U_in_min = 0.1e-3;%%最小流入速度[m/s]





